#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.

num1 = 25
num2 = 5
print((num1 + num2), (num1- num2), (num1 / num2), (num1 * num2), (num1 // num2), (num1 % num2), (num1 ** num2))

