#todo: Определить в коде  переменные:

1. Целочисленного типа
a = 10
print(a)
print(type(a))

2. Вещественного типа
a = 1.1
print(a)
print(type(a))

3. Логического типа
a = 2
b = 2
print(bool(a * b))

4. Строкового типа
a = "Good day!"
print(a)
print(type(a))

5. Пустого типа
a = None
print(a)
print(type(a))


Вывести все их типы.


